读取文本文件(或平面文件)的两个主要功能是read_csv()和read_table()。它们都使用相同的解析代码来智能地将表格数据转换为DataFrame对象

In [5]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./data.csv')
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

#### 自定义索引

In [11]:
df = pd.read_csv('./data.csv',index_col='S.No')
df

        Name  Age       City  Salary
S.No
1        Tom   28    Toronto   20000
2        Lee   32   HongKong    3000
3     Steven   43   Bay Area    8300
4        Ram   38  Hyderabad    3900

#### 转换器
dtype的列可以作为字典传递

In [13]:
print(df.dtypes)
df = pd.read_csv('./data.csv',dtype={'Salary':np.float64})
print(df.dtypes)
print(df)

S.No        int64
Name       object
Age         int64
City       object
Salary    float64
dtype: object
S.No        int64
Name       object
Age         int64
City       object
Salary    float64
dtype: object
   S.No    Name  Age       City   Salary
0     1     Tom   28    Toronto  20000.0
1     2     Lee   32   HongKong   3000.0
2     3  Steven   43   Bay Area   8300.0
3     4     Ram   38  Hyderabad   3900.0

#### header_names
使用names参数指定标题的名称

In [16]:
df = pd.read_csv('./data.csv',names=['a', 'b', 'c','d','e'])
df

      a       b    c          d       e
0  S.No    Name  Age       City  Salary
1     1     Tom   28    Toronto   20000
2     2     Lee   32   HongKong    3000
3     3  Steven   43   Bay Area    8300
4     4     Ram   38  Hyderabad    3900

In [20]:
# 标题名称附加了自定义名称，但文件中的标题还没有被消除。 现在，使用header参数来删除它
# 如果标题不是第一行，则将行号传递给标题。这将跳过前面的行
df = pd.read_csv('./data.csv', names=['a','b','c','d','e'],header=0)
print(df)

   a       b   c          d      e
0  1     Tom  28    Toronto  20000
1  2     Lee  32   HongKong   3000
2  3  Steven  43   Bay Area   8300
3  4     Ram  38  Hyderabad   3900

#### skiprows
skiprows跳过指定的行数

In [24]:
df = pd.read_csv('./data.csv',skiprows=2,names=['a','b','c','d','e'])
print(df)

   a       b   c          d      e
0  1     Tom  28    Toronto  20000
1  2     Lee  32   HongKong   3000
2  3  Steven  43   Bay Area   8300
3  4     Ram  38  Hyderabad   3900